{"class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "dtype": "float32", "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "name": "conv2d_1", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "same", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_2", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "same", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_3", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "same", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 1024, "use_bias": true, "name": "dense_1", "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 36, "use_bias": true, "name": "dense_2", "bias_constraint": null}}], "backend": "tensorflow"}