{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "batch_input_shape": [null, 20, 20, 1], "dtype": "float32", "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "trainable": true, "name": "conv2d_1", "padding": "valid", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 64, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "name": "conv2d_2", "padding": "valid", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "config": {"filters": 128, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "name": "conv2d_3", "padding": "valid", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 128, "trainable": true, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 36, "trainable": true, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}]}